-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 58.239.58.243    Database: java405_team2
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `reservation`
--

DROP TABLE IF EXISTS `reservation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reservation` (
  `res_id` int NOT NULL AUTO_INCREMENT,
  `res_time` int NOT NULL,
  `reservation_date` date NOT NULL,
  `state` varchar(50) NOT NULL,
  `createdAt` date NOT NULL,
  `cafe_id` int NOT NULL,
  `user_id` varchar(45) NOT NULL,
  `theme_id` int NOT NULL,
  `cafe_name` varchar(100) NOT NULL,
  `theme_title` varchar(100) NOT NULL,
  `res_payment` int NOT NULL,
  `res_people` int NOT NULL,
  `serial_num` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`res_id`),
  KEY `user_id_idx` (`user_id`),
  KEY `cafe_id_idx` (`cafe_id`),
  KEY `theme_id_idx` (`theme_id`),
  CONSTRAINT `cafe_id` FOREIGN KEY (`cafe_id`) REFERENCES `cafe` (`cafe_id`),
  CONSTRAINT `theme_id` FOREIGN KEY (`theme_id`) REFERENCES `theme` (`theme_idx`),
  CONSTRAINT `user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reservation`
--

LOCK TABLES `reservation` WRITE;
/*!40000 ALTER TABLE `reservation` DISABLE KEYS */;
INSERT INTO `reservation` VALUES (1,20,'2024-07-30','T','2024-07-27',1,'test1',1,'홍대던전','사라진 보물 : 대저택의 비밀',50000,4,NULL),(2,15,'2024-07-30','T','2024-07-27',1,'test1',2,'홍대던전','날씨의 신 (홍대)',50000,4,NULL),(3,10,'2024-07-30','T','2024-07-27',2,'test1',8,'강남던전','LOST KINGDOM : 잊혀진 전설',50000,4,NULL),(4,10,'2024-08-01','T','2024-07-29',6,'test1',9,'서면던전 레드(부산)','고시원 살인사건',40000,4,NULL),(5,10,'2024-08-01','T','2024-07-31',1,'test1',1,'홍대던전','사라진 보물 : 대저택의 비밀',50000,4,NULL),(7,15,'2024-08-01','T','2024-07-31',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',50000,4,NULL),(8,20,'2024-08-02','T','2024-07-31',6,'test2',9,'서면던전 레드(부산)','고시원 살인사건',40000,4,NULL),(9,10,'2024-08-03','T','2024-08-01',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',50000,4,'2024-08-0311695'),(10,15,'2024-08-03','T','2024-08-01',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',45000,4,'2024-08-0311445'),(11,15,'2024-08-02','T','2024-08-02',1,'test1',1,'홍대던전','사라진 보물 : 대저택의 비밀',46300,4,'2024-08-0211976'),(12,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(13,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(14,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(15,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(16,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(17,20,'2024-08-02','T','2024-08-02',1,'test2',1,'홍대던전','사라진 보물 : 대저택의 비밀',44300,4,'2024-08-0211846'),(18,15,'2024-08-03','T','2024-08-02',1,'test2',2,'홍대던전','날씨의 신 (홍대)',44300,4,'2024-08-0312617'),(19,10,'2024-08-08','T','2024-08-02',6,'test2',9,'서면던전 레드(부산)','고시원 살인사건',34300,4,'2024-08-0869139'),(20,10,'2024-08-08','T','2024-08-02',6,'test2',9,'서면던전 레드(부산)','고시원 살인사건',34300,4,'2024-08-0869139'),(21,10,'2024-08-07','T','2024-08-02',6,'test2',9,'서면던전 레드(부산)','고시원 살인사건',34300,4,'2024-08-0769678'),(22,15,'2024-08-08','T','2024-08-02',1,'test1',3,'홍대던전','꿈의 공장 (홍대)',46300,4,'2024-08-0813762'),(23,20,'2024-08-02','T','2024-08-02',1,'test1',2,'홍대던전','날씨의 신 (홍대)',46300,4,'2024-08-0212376'),(24,20,'2024-08-02','T','2024-08-02',1,'test1',3,'홍대던전','꿈의 공장 (홍대)',46300,4,'2024-08-0213155'),(25,20,'2024-08-02','T','2024-08-02',1,'test1',4,'홍대던전','오늘 나는 (홍대)',46300,4,'2024-08-021495'),(26,15,'2024-08-07','T','2024-08-03',1,'test2',3,'홍대던전','꿈의 공장 (홍대)',44300,4,'2024-08-0713566'),(27,10,'2024-08-06','T','2024-08-06',1,'test1',1,'홍대던전','사라진 보물 : 대저택의 비밀',46300,4,'2024-08-0611303'),(28,10,'2024-08-07','T','2024-08-06',1,'test1',2,'홍대던전','날씨의 신 (홍대)',46300,4,'2024-08-0712337'),(29,10,'2024-08-06','T','2024-08-06',1,'test2',3,'홍대던전','꿈의 공장 (홍대)',44300,4,'2024-08-0613322'),(30,20,'2024-08-07','T','2024-08-06',1,'test2',4,'홍대던전','오늘 나는 (홍대)',44300,4,'2024-08-0714979'),(31,10,'2024-08-06','T','2024-08-06',6,'test1',10,'서면던전 레드(부산)','AMEN',39300,4,'2024-08-06610920'),(32,10,'2024-08-06','T','2024-08-06',6,'test1',11,'서면던전 레드(부산)','산장으로의 초대',39300,4,'2024-08-06611827'),(33,10,'2024-08-06','T','2024-08-06',2,'test1',6,'강남던전','대호시장 살인사건',49300,4,'2024-08-062688'),(34,20,'2024-08-06','T','2024-08-06',2,'test1',6,'강남던전','대호시장 살인사건',49300,4,'2024-08-0626712'),(35,15,'2024-08-06','T','2024-08-06',2,'test2',5,'강남던전','강남목욕탕',44300,4,'2024-08-0625303'),(36,20,'2024-08-06','T','2024-08-06',1,'test22',1,'홍대던전','사라진 보물 : 대저택의 비밀',50000,4,'2024-08-061163'),(37,10,'2024-08-09','T','2024-08-06',2,'test22',5,'강남던전','강남목욕탕',49300,4,'2024-08-0925811'),(38,10,'2024-08-07','T','2024-08-06',2,'test33',5,'강남던전','강남목욕탕',50000,4,'2024-08-0725134'),(39,10,'2024-08-08','T','2024-08-06',6,'test33',10,'서면던전 레드(부산)','AMEN',39300,4,'2024-08-08610108'),(40,15,'2024-08-07','T','2024-08-06',2,'test44',6,'강남던전','대호시장 살인사건',50000,4,'2024-08-0726677'),(41,10,'2024-08-10','T','2024-08-06',6,'test44',12,'서면던전 레드(부산)','부적',39300,4,'2024-08-10612565');
/*!40000 ALTER TABLE `reservation` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-08-07 16:19:17
